// Задание 2 
// Console.Clear();
// Console.Write("Введите 2 числа для сравнения:\n ");
// Console.Write("Введите 1-е число для сравнения: ");
// int a = Convert.ToInt32(Console.ReadLine()!);
// Console.Write("Введите 2-е число для сравнения: ");
// int b = Convert.ToInt32(Console.ReadLine()!);
// if (a > b) a=max; 
//     b=min;
// else b=max;
//     a=min;
// Console.Write("Результат число " + max + " - Максимальное\n ");
// Console.Write("Результат число " + min + " - Минимальное\n ");